/*⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⢀⣀⣤⣤⣤⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⢀⣼⠟⠉⠉⠉⠉⠉⠉⠉⠙⠻⢶⣄⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀   ⠀⠀⠙⣷⡀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣸⡟⠀⣠⣶⠛⠛⠛⠛⠛⠛⠳⣦⡀⠀ ⠘⣿⡄⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⢠⣿⠁⠀⢹⣿⣦⣀⣀⣀⣀⣀⣠⣼⡇⠀⠀ ⠸⣷⠀⠀
⠀⠀⠀⠀⠀⠀⠀  ⠀⣼⡏⠀⠀⠀⠉⠛⠿⠿⠿⠿⠛⠋⠁⠀⠀  ⠀ ⣿⡄
⠀⠀      ⠀⢠⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⢻⡇⠀
		 ⣸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⢸⡇⠀
⠀⠀⠀⠀⠀⠀ ⠀⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⢸⣧⠀
⠀⠀⠀⠀⠀  ⢸⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⠈⣿⠀
⠀⠀⠀⠀⠀⠀⠀⣾⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀     ⣿⠀
⠀⠀⠀⠀⠀⠀⠀⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀     ⣿⠀
⠀⠀⠀⠀⠀⠀⢰⣿⠀⠀⠀⠀⣠⡶⠶⠿⠿⠿⠿⢷⣦⠀⠀⠀⠀⠀   ⠀⣿⠀
⠀⠀⣀⣀⣀⠀⣸⡇⠀⠀⠀⠀⣿⡀⠀⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀   ⣿⠀
⣠⡿⠛⠛⠛⠛⠻⠀⠀⠀⠀⠀⢸⣇⠀⠀⠀⠀⠀⠀⣿⠇⠀⠀⠀⠀⠀   ⣿⠀
⢻⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⡟⠀⠀⢀⣤⣤⣴⣿⠀⠀⠀⠀⠀⠀   ⣿⠀
⠈⠙⢷⣶⣦⣤⣤⣤⣴⣶⣾⠿⠛⠁⢀⣶⡟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡟⠀
	 ⠉⠉⠉⠉⠉⠄⠀⠀⠀⠀⠈⣿⣆⡀⠀⠀⠀⠀⠀⠀⢀⣠⣴⡾⠃⠀
⠀           ⠀⠀⠀⠀⠀⠈⠛⠻⢿⣿⣾⣿⡿⠿⠟⠋⠁



⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠋⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠛⠿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⠏⠀⢠⣦⡀⣤⣠⡄⢠⠦⡄⣠⠤⠀⣤⠀⡆⣤⣶⡀⠀⠈⠻⣿
⣿⣿⣿⣿⣿⣿⠀⠀⠟⠻⠃⠏⠉⠇⠸⠶⠋⠻⠾⠇⠙⠒⠃⠘⠾⠃⠀⠀⢀⣿
⣿⣿⣿⣿⣿⣿⣷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣠⣴⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⠿⠿⠿⠿⠷⣶⣶⣶⣶⣶⡆⢀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⠟⠉⠀⠀⠒⠀⠀⠀⠀⠉⢻⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⠀⠀⠀⠦⣀⣶⡶⠀⢤⣠⣤⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣷⣤⣀⡲⠶⣶⣤⣔⣀⣤⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⠿⠿⠃⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⠏⢀⠤⠄⠀⠀⢀⡈⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⡟⠀⠸⠦⣠⠘⠁⢨⠃⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⠃⠀⠑⠤⠤⠔⠚⢥⣤⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⡿⠀⠀⠀⣀⣀⡀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⡇⠀⠀⣰⣿⣿⣿⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣧⣀⡀⠉⣻⣿⣧⣤⣤⣤⣤⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀
*/


#include <iostream>
#include <cmath>

int main() {
	setlocale(0, "");
	using namespace std;

    int choice;
	cout << "Выберите программу\n1. Обьем и полная поверхность усеченного конуса\n2. Разветвление\n3. Вычисление z = ln(b-y)sqrt(b-x)\n4. 10 чисел по порядку\n5. Табуляция функции с шагом 0.5 от -4 до 4\n";
	cin >> choice;

	switch (choice) {
		case (1): {
			double h, r, R;

			cout << "Введите высоту: ";
			if (!(cin >> h) || (h < 0)) { cout << "Введите правильную высоту\n"; return 0; };
			cout << "Введите больший радиус: ";
			if (!(cin >> R) || (R < 0)) { cout << "Введите правильный больший радиус\n"; return 0; };
			cout << "Введите меньший радиус: ";
			if (!(cin >> r) || (r < 0)) { cout << "Введите правильный меньший радиус\n"; return 0; };

			const double pi = 3.14159265;
			double l = sqrt(h * h + ((R - r) * (R - r)));
			double V = (pi * h * (R * R + R * r + r * r)) / 3.0;
			double S = pi * (R * R + (R + r) * l - r * r);
			cout << "Обьем: " << V << "\nПолная поверхность конуса: " << S << endl;
			break;
		}
		case (2): {
			double a, x;
			cout << "Введите a: ";
			if (!(cin >> a)) { cout << "Не то ввел"; return 0; };
			cout << "Введите x: ";
			if (!(cin >> x)) { cout << "Не то ввел"; return 0; };
			if (abs(x) <= 1 && a >= x * x) cout << sqrt(a - x * x) << endl;
			else if (abs(x) > 1 && x != 0) cout << a * log(abs(x)) << endl;
			else cout << "Ничего не выйдет";
			break;
		}
		case (3): {
			double x, b, y;

			cout << "Введите x: ";
			if (!(cin >> x)) { cout << "Не то ввел"; return 0; };
			cout << "Введите b: ";
			if (!(cin >> b)) { cout << "Не то ввел"; return 0; };
			cout << "Введите y ";
			if (!(cin >> y)) { cout << "Не то ввел"; return 0; };
			if (b > y && b >= x) cout << log(b - y) * sqrt(b - x) << endl;
			else cout << "Ничего не выйдет";
			break;
		}
		case (4): {
			int n;
			cout << "С какого числа будем их выводить по порядку: ";
			if (!(cin >> n)) { cout << "Не то ввел"; return 0;}
			if (n < 1) n = 1;
			for (int i = n + 10; n < i; n++) cout << n << " ";
			break;
		}	
		case (5): {
			for (double x = -4; x <= 4; x += 0.5) {
				if (x != 1) cout << "X = " << x << " --> " << (x * x - 2 * x + 2) / (x - 1) << endl;
				else cout << "X = 1 --> Деление на 0 \n";
			}
			break;
		}
		default: cout << "Не то ввел\n";
	}
	system("pause");
}
