/*⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⢀⣀⣤⣤⣤⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⢀⣼⠟⠉⠉⠉⠉⠉⠉⠉⠙⠻⢶⣄⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀   ⠀⠀⠙⣷⡀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣸⡟⠀⣠⣶⠛⠛⠛⠛⠛⠛⠳⣦⡀⠀ ⠘⣿⡄⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⢠⣿⠁⠀⢹⣿⣦⣀⣀⣀⣀⣀⣠⣼⡇⠀⠀ ⠸⣷⠀⠀
⠀⠀⠀⠀⠀⠀⠀  ⠀⣼⡏⠀⠀⠀⠉⠛⠿⠿⠿⠿⠛⠋⠁⠀⠀  ⠀ ⣿⡄
⠀⠀      ⠀⢠⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⢻⡇⠀
		 ⣸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⢸⡇⠀
⠀⠀⠀⠀⠀⠀ ⠀⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⢸⣧⠀
⠀⠀⠀⠀⠀  ⢸⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⠈⣿⠀
⠀⠀⠀⠀⠀⠀⠀⣾⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀     ⣿⠀
⠀⠀⠀⠀⠀⠀⠀⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀     ⣿⠀
⠀⠀⠀⠀⠀⠀⢰⣿⠀⠀⠀⠀⣠⡶⠶⠿⠿⠿⠿⢷⣦⠀⠀⠀⠀⠀   ⠀⣿⠀
⠀⠀⣀⣀⣀⠀⣸⡇⠀⠀⠀⠀⣿⡀⠀⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀   ⣿⠀
⣠⡿⠛⠛⠛⠛⠻⠀⠀⠀⠀⠀⢸⣇⠀⠀⠀⠀⠀⠀⣿⠇⠀⠀⠀⠀⠀   ⣿⠀
⢻⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⡟⠀⠀⢀⣤⣤⣴⣿⠀⠀⠀⠀⠀⠀   ⣿⠀
⠈⠙⢷⣶⣦⣤⣤⣤⣴⣶⣾⠿⠛⠁⢀⣶⡟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡟⠀
	 ⠉⠉⠉⠉⠉⠄⠀⠀⠀⠀⠈⣿⣆⡀⠀⠀⠀⠀⠀⠀⢀⣠⣴⡾⠃⠀
⠀           ⠀⠀⠀⠀⠀⠈⠛⠻⢿⣿⣾⣿⡿⠿⠟⠋⠁



⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠋⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠛⠿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⠏⠀⢠⣦⡀⣤⣠⡄⢠⠦⡄⣠⠤⠀⣤⠀⡆⣤⣶⡀⠀⠈⠻⣿
⣿⣿⣿⣿⣿⣿⠀⠀⠟⠻⠃⠏⠉⠇⠸⠶⠋⠻⠾⠇⠙⠒⠃⠘⠾⠃⠀⠀⢀⣿
⣿⣿⣿⣿⣿⣿⣷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣠⣴⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⠿⠿⠿⠿⠷⣶⣶⣶⣶⣶⡆⢀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⠟⠉⠀⠀⠒⠀⠀⠀⠀⠉⢻⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⠀⠀⠀⠦⣀⣶⡶⠀⢤⣠⣤⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣷⣤⣀⡲⠶⣶⣤⣔⣀⣤⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⠿⠿⠃⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⠏⢀⠤⠄⠀⠀⢀⡈⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⡟⠀⠸⠦⣠⠘⠁⢨⠃⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⠃⠀⠑⠤⠤⠔⠚⢥⣤⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⡿⠀⠀⠀⣀⣀⡀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⡇⠀⠀⣰⣿⣿⣿⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣧⣀⡀⠉⣻⣿⣧⣤⣤⣤⣤⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀
*/


#include <iostream>

int main(int choice) {
	setlocale(LC_ALL, "Russian");
	using namespace std;

	cout << "Это второе ДЗ\n";
	choiceg:cout << "Выберите программу: ";
	cin >> choice;

	switch (choice) {
		case (1): {
			double h, r, R;

			hg:cout << "Введите высоту: ";
			if (!(cin >> h) || (h < 0)) { cout << "Введите правильную высоту\n"; goto hg; };
			Rg:cout << "Введите больший радиус: ";
			if (!(cin >> R) || (R < 0)) { cout << "Введите правильный больший радиус\n"; goto Rg; };
			rg:cout << "Введите меньший радиус: ";
			if (!(cin >> r) || (r < 0)) { cout << "Введите правильный меньший радиус\n"; goto rg; };

			double pi = 3.14159265;
			double l = sqrt(h * h + ((R - r) * (R - r)));
			double V = (pi * h * (R * R + R * r + r * r)) / 3.0;
			double S = pi * (R * R + (R + r) * l - r * r);
			cout << "Обьем: " << V << endl << "Полная поверхность конуса: " << S << endl;
			break;
		}
		case (2): {
			double a, x;
			agoto2:std::cout << "Введите a: ";
			if (!(cin >> a)) { cout << "Не то ввел, попробуй еще раз"; goto agoto2; };
			xgoto2:std::cout << "Введите x: ";
			if (!(cin >> x)) { cout << "Не то ввел, попробуй еще раз"; goto xgoto2; };
			if ((x >= 1 || x <= -1) && a < x * x) cout << sqrt(a - x * x) << endl;
			else if ((x < 1 && x > -1) && x != 0) cout << a * log(abs(x)) << endl;
			else {
				cout << "Ничего не выйдет, можешь попробовать еще раз \nВведи '1' для повтора: ";
				bool choiceinner; cin >> choiceinner;
				if (choiceinner) goto agoto2;
			}
			break;
		}
		case (3): {
			double x, b, y;

			xgoto3:cout << "Введите x: ";
			if (!(cin >> x)) { cout << "Не то ввел, попробуй еще раз"; goto xgoto3; };
			bgoto3:cout << "Введите b: ";
			if (!(cin >> b)) { cout << "Не то ввел, попробуй еще раз"; goto bgoto3; };
			ygoto3:cout << "Введите y ";
			if (!(cin >> y)) { cout << "Не то ввел, попробуй еще раз"; goto bgoto3; };
			if (b > y && b >= x) cout << log(b - y) * sqrt(b - x) << endl;
			else {
				cout << "Ничего не выйдет, можешь попробовать еще раз \nВведи '1' для повтора: ";
				bool choiceinner; cin >> choiceinner;
				if (choiceinner) goto xgoto3;
			}
			break;
		}
		case (4): {
			double n;
			ngoto4:cout << "С какого числа будем искать натуральные числа? ";
			if (!(cin >> n)) { cout << "Не то ввел, попробуй еще раз"; goto ngoto4; };
			if (n < 1) n = 1;
			for (int i = 0; i < 10; i++) { cout << n << " "; n++; }
			break;
		}	
		case (5): {
			for (double x = -4; x <= 4; x += 0.5) {
				if (x != 1) cout << "X = " << x << " > " << (x * x - 2 * x + 2) / (x - 1) << endl;
				else cout << "X = 1 > Деление на 0 \n";
			}
			break;
		}
		default: {cout << "Не то ввел, чувак. Попробуй еще раз\n"; goto choiceg; }
	}
	system("pause");
}